read_verilog ../verilog/pow32.v cells.v

synth -top pow32 -flatten

dfflibmap -liberty stdcell.lib
abc -liberty stdcell.lib
clean

write_verilog synth.v
#write_bitslice synth.slice
write_ccode synth.c
